test/load/lite.config.yml
config:
  target: "http://pi-baker-0.local:8080/function"
  http:
    timeout: 10
    pool: 100
  processor: "./processor.js"

  phases:
    - duration: 60
      arrivalRate: 12
      name: "Warming up"
    # - duration: 300
    #   arrivalCount: 1000000
    #   name: "Sustain max load"
    - duration: 120
      arrivalRate: 510
      name: "You wish"

scenarios:
  - flow:
  #    - log: "New virtual user running base64"
    - loop:
        - post:
            beforeRequest:
              - setFunc
              - setText
            url: "/{{ Function }}"
            text: "{{ ReqText }}"
      count: 100